README.org
#+title: dev.metalisp.survey
#+author: Marcus Kammer
#+email: marcus.kammer@metalisp.dev

* dev.metalisp.survey
** Introduction

I am developing a web application using Common Lisp, designed to administer the
System Usability Scale (SUS) questionnaire efficiently. This application
simplifies the process of conducting usability evaluations by presenting SUS
questions and collecting responses, streamlining both the gathering and
analysis of usability feedback.

The software focuses on enhancing the ease of creating, managing, and
integrating questionnaires within existing websites or software. Leveraging
flexible templates, it offers a high level of reusability and
adaptability. Data from multiple questionnaires can be synthesized within a
single study, facilitating more profound insights. As a self-hosted solution,
it assures enhanced data protection, granting users complete control over their
data, a crucial feature for sensitive data environments. This application is
aimed at significantly contributing to research projects, market research, and
other fields where precise data collection and analysis are vital.

** Design Goals

1. *Integration*: The app integrates seamlessly into existing digital
   platforms, enhancing user experience and simplifying data capture.

2. *Reusability and Adaptability*: Customizable templates allow for the
   creation of consistent and repeatable survey formats suitable for various
   applications.

3. *Data Synthesis*: It supports combining data from multiple questionnaires
   into a single study, providing broader and more comprehensive analytical
   insights.

4. *Privacy and Control*: With self-hosting, the software ensures complete data
   sovereignty and enhances privacy, avoiding the need to transfer sensitive
   data to external servers.

5. *Accessibility*: The application is designed following the Web
   Content Accessibility Guidelines (WCAG) provided by WebAIM,
   ensuring that the survey is accessible to all users, including
   those with disabilities. This includes features such as keyboard
   navigation, screen reader compatibility, and high contrast modes to
   accommodate users with varying needs and abilities.

** Dependencies
- https://github.com/edicl/hunchentoot
- https://git.sr.ht/~marcuskammer/dev.metalisp.sbt
** Mailing list
- https://lists.sr.ht/~marcuskammer/dev.metalisp.survey
** Issue tracker
- https://todo.sr.ht/~marcuskammer/dev.metalisp.survey
** News Feed
- https://git.sr.ht/~marcuskammer/dev.metalisp.survey/log/main/rss.xml
** Installation instructions
*** 1. Install a Common Lisp implementation

   - Ensure you have a Common Lisp implementation installed. Common options
     include SBCL (Steel Bank Common Lisp) and CCL (Clozure Common Lisp). You
     can download and install them from their respective websites:

     - [[http://www.sbcl.org/][SBCL]]
     - [[https://ccl.clozure.com/][CCL]]

*** 2. Set up ASDF

   - ASDF is typically bundled with modern Lisp implementations. However, if
     it's not present, you can download it from [[https://gitlab.common-lisp.net/asdf/asdf][ASDF's repository]].

*** 3. Organize the project directory

   - Place the =dev.metalisp.survey= project in the =~/common-lisp=
     directory. Ensure the directory structure looks like this:

     #+BEGIN_EXAMPLE
     ~/common-lisp/
       └── dev.metalisp.survey/
           ├── dev.metalisp.survey.asd
           └── src/
               └── app.lisp
     #+END_EXAMPLE

*** 4. Configure ASDF to find the project

   - Open your Common Lisp REPL and run the following commands to set up the
     ASDF central registry:

     #+BEGIN_SRC lisp
     ;; Ensure ASDF is loaded
     (require :asdf)

     ;; Add ~/common-lisp to the ASDF central registry
     (push #p"~/common-lisp/" asdf:*central-registry*)
     #+END_SRC

*** 5. Load the project

   - In your REPL, load the project by running:

     #+BEGIN_SRC lisp
     (asdf:load-system :dev.metalisp.survey)
     #+END_SRC

*** 6. Run the project

   - After loading the system, you can run the main function or entry point of
     the project.
     =ml-survey:start=, you would execute:

     #+BEGIN_SRC lisp
     (ml-survey:start)
     #+END_SRC

*** Optional: Example Initialization in .sbclrc

To make the ASDF configuration persistent across REPL sessions, you can add the
setup to your =.sbclrc= file:

1. Edit =.sbclrc=
   - Open (or create) the =.sbclrc= file in your home directory and add the
     following lines:

     #+BEGIN_SRC lisp
     (require :asdf)
     (push #p"~/common-lisp/" asdf:*central-registry*)
     #+END_SRC

2. Reload SBCL
   - The next time you start SBCL, it will automatically include the
     =~/common-lisp= directory in the ASDF central registry.

** License

MIT
